In [7]:
import numpy as np
import pandas as pd
import pymysql
from sklearn.preprocessing import FunctionTransformer, LabelEncoder, StandardScaler
from sklearn.pipeline import Pipeline

In [2]:
df=pd.read_csv("train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
#● Display the first few rows to understand the dataset. 
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
# Select only the required columns
def select_columns(df):
    # Make a copy to avoid modifying the original DataFrame
    df = df.copy()
    cols = ["PassengerId", "Survived", "Pclass", "Sex", "Age", "Fare", "Embarked"]
    df = df[cols]
    return df

# Handle missing values for Age (median) and Embarked (most frequent)
def handle_missing(df):
    # Make a copy to avoid modifying the original DataFrame
    df = df.copy()
    # Fill missing Age with the median value
    df["Age"] = df["Age"].fillna(df["Age"].median())
    # Fill missing Embarked with the most frequent value (mode)
    df["Embarked"] = df["Embarked"].fillna(df["Embarked"].mode()[0])
    return df

# Prepare encoders and scaler as global objects
gender_encoder = LabelEncoder()
embarked_encoder = LabelEncoder()
scaler = StandardScaler()

# Encode categorical columns: Sex (Gender) and Embarked
def encode_categorical(df):
    # Make a copy to avoid modifying the original DataFrame
    df = df.copy()
    # Apply label encoding to the Sex column
    df["Sex"] = gender_encoder.fit_transform(df["Sex"])
    # Apply label encoding to the Embarked column
    df["Embarked"] = embarked_encoder.fit_transform(df["Embarked"])
    return df

# Scale numeric columns: Age and Fare using StandardScaler
def scale_numeric(df):
    # Make a copy to avoid modifying the original DataFrame
    df = df.copy()
    # Apply StandardScaler to Age and Fare columns
    df[["Age", "Fare"]] = scaler.fit_transform(df[["Age", "Fare"]])
    return df

# Build the transformation pipeline
pipeline = Pipeline([
    ("select_columns", FunctionTransformer(select_columns)),
    ("handle_missing", FunctionTransformer(handle_missing)),
    ("encode_categorical", FunctionTransformer(encode_categorical)),
    ("scale_numeric", FunctionTransformer(scale_numeric)),
])

# Apply the pipeline to the original Titanic DataFrame df
df_transformed = pipeline.fit_transform(df)

# Check for any remaining missing values
print(df_transformed.isna().sum())

# Display first rows of the final cleaned DataFrame
print(df_transformed.head())

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
Fare           0
Embarked       0
dtype: int64
   PassengerId  Survived  Pclass  Sex       Age      Fare  Embarked
0            1         0       3    1 -0.565736 -0.502445         2
1            2         1       1    0  0.663861  0.786845         0
2            3         1       3    0 -0.258337 -0.488854         2
3            4         1       1    0  0.433312  0.420730         2
4            5         0       3    1  0.433312 -0.486337         2

In [12]:
df_transformed.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
Fare           0
Embarked       0
dtype: int64

In [13]:
df_transformed

     PassengerId  Survived  Pclass  Sex       Age      Fare  Embarked
0              1         0       3    1 -0.565736 -0.502445         2
1              2         1       1    0  0.663861  0.786845         0
2              3         1       3    0 -0.258337 -0.488854         2
3              4         1       1    0  0.433312  0.420730         2
4              5         0       3    1  0.433312 -0.486337         2
..           ...       ...     ...  ...       ...       ...       ...
886          887         0       2    1 -0.181487 -0.386671         2
887          888         1       1    0 -0.796286 -0.044381         2
888          889         0       3    0 -0.104637 -0.176263         2
889          890         1       1    1 -0.258337 -0.044381         0
890          891         0       3    1  0.202762 -0.492378         1

[891 rows x 7 columns]

In [31]:
print("Before rename:", df_transformed.columns.tolist())

df_transformed = df_transformed.rename(columns={
    "Age": "num__Age",
    "Fare": "num__Fare",
    "Sex_female": "cat__Sex_0",
    "Sex_male": "cat__Sex_1",
    "Embarked_C": "cat__Embarked_0",
    "Embarked_Q": "cat__Embarked_1",
    "Embarked_S": "cat__Embarked_2"
})

print("After rename:", df_transformed.columns.tolist())

Before rename: ['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'Fare', 'Embarked']
After rename: ['PassengerId', 'Survived', 'Pclass', 'Sex', 'num__Age', 'num__Fare', 'Embarked']

In [37]:
df_transformed.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'num__Age', 'num__Fare',
       'Embarked'],
      dtype='object')

LOAD (Using PyMySQL)

A. Create a new MySQL database:

In [38]:
connection = pymysql.connect(
    host="localhost",
    user="root",
    password="Oman99690050#",
    charset="utf8mb4",
    autocommit=True
)
cursor = connection.cursor()

cursor.execute("CREATE DATABASE IF NOT EXISTS titanic_db ;")
cursor.execute("USE titanic_db ;")

cursor = connection.cursor()
print('ok')

ok

B. Create a table named:  titanic_clean

In [40]:
# Create table that matches df_transformed columns
cursor.execute("""
DROP TABLE IF EXISTS titanic_clean;
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS titanic_clean (
    PassengerId INT,
    Survived INT,
    Pclass INT,
    Sex INT,          -- encoded gender (e.g., 0, 1)
    num__Age FLOAT,   -- scaled age
    num__Fare FLOAT,  -- scaled fare
    Embarked INT      -- encoded embarked (e.g., 0,1,2)
);
""")

print("Table 'titanic_clean' created successfully!")

Table 'titanic_clean' created successfully!

In [41]:
# C. Load the cleaned data into MySQL

# Prepare the INSERT statement
insert_sql = """
INSERT INTO titanic_clean (
    PassengerId, Survived, Pclass,
    Sex, num__Age, num__Fare,
    Embarked
)
VALUES (%s,%s,%s,%s,%s,%s,%s);
"""

# Loop over each row in the cleaned DataFrame
for _, row in df_transformed.iterrows():
    cursor.execute(insert_sql, (
        int(row["PassengerId"]),   # Passenger ID
        int(row["Survived"]),      # Survival status
        int(row["Pclass"]),        # Passenger class
        int(row["Sex"]),           # Encoded gender
        float(row["num__Age"]),    # Scaled age
        float(row["num__Fare"]),   # Scaled fare
        int(row["Embarked"])       # Encoded embarked port
    ))

# Commit all inserts to the database
connection.commit()

print("All cleaned rows inserted successfully into 'titanic_clean'!")

All cleaned rows inserted successfully into 'titanic_clean'!

In [42]:
cursor.execute("SELECT * FROM titanic_clean;")
rows = cursor.fetchall()

for row in rows[:10]:   # نعرض أول 10 صفوف فقط
    print(row)

(1, 0, 3, 1, -0.565736, -0.502445, 2)
(2, 1, 1, 0, 0.663861, 0.786845, 0)
(3, 1, 3, 0, -0.258337, -0.488854, 2)
(4, 1, 1, 0, 0.433311, 0.42073, 2)
(5, 0, 3, 1, 0.433311, -0.486337, 2)
(6, 0, 3, 1, -0.104637, -0.478116, 1)
(7, 0, 1, 1, 1.89346, 0.395814, 2)
(8, 0, 3, 1, -2.10273, -0.224083, 2)
(9, 1, 3, 0, -0.181487, -0.424256, 2)
(10, 1, 2, 0, -1.18054, -0.0429555, 0)

In [44]:
print("-"*70)

----------------------------------------------------------------------

In [43]:
#TRANSFORM (Pipeline + ColumnTransformer)